{
    "name": "ArrayList",
    "version": "1.0.3",
    "description": "A Basic ArrayList Structure which supports Dynamic and Fixed Arrays",
    "keywords": ["ArrayList", "Dynamic List", "Fixed List", "List", "Array", "Dynamic Array", "Fixed Array", "Array List", "Dynamic Array List", "Fixed Array List", "Dynamic List Array", "Fixed List Array", "Data Structure", "Utilities", "Dynamic Data Structure"],
    "repository": {
        "type": "git",
        "url": "https://github.com/braydenanderson2014/C-Arduino-Libraries/tree/main/ArrayList.git"
    },
    "authors": [
        {
            "name": "Brayden Anderson",
            "email": "braydenanderson2014@gmail.com",
            "url": "https://github.com/braydenanderson2014"
        }
    ],
    "dependencies": {
        "Arduino": "*"
    },
    "categories": [
        "Data Structures",
        "Utilities"
    ],
    "examples": [
        {
            "name": "Auto Dynamic Example",
            "base": "Example",
            "files": [
                "Example.cpp"
            ]
        },
        {
            "name": "Fixed Size Example",
            "base": "Example",
            "files": [
                "Example2.cpp"
            ]
        }
    ],
    "ChangeLog": [
        {
            "version": "1.0.0",
            "date": "2023-11-20",
            "changes": [
                "Initial release",
                "Please Note, This Library Has not been Tested in any Shape or form, USE AT YOUR OWN RISK",
                "Although this library has not been tested, We do encourage you to use this library so we can find bugs and fix them." 
            ]
        },
        {
            "version": "1.0.1",
            "date": "2023-11-26",
            "changes": [
                "Updated the constructor to accept a boolean value to determine if the Serial.println should be used or not",
                "Added a bunch new functions to the library which have not been tested yet... These functions are based off of Java's ArrayList Class" 
            ]
        },
        {
            "version": "1.0.2",
            "date": "2023-11-29",
            "changes": [
                "Added new SubLibrary ArrayListOperations which allows you to run mathmatics on your ArrayList. (Note: ArrayList *MUST* be an Integer or other number type ArrayList. Strings may not behave correctly);",
                "Documentation for new SubLibrary ArrayListOperations has been added to the README.md file",
                "Some functions in the ArrayListOperations are exactly the same, just with a different function name. Just be aware of this when utilizing the library." 
            ]
        },
        {
            "version": "1.0.3",
            "date": "2024-01-31",
            "changes": [
                "Removed the ArrayListOperations SubLibrary. It has been moved to its own library called Operators",
                "Added new toString() function to the ArrayList Class",
                "Added new getAsString() function to return a String instead of a type T",
                "Deprecated the setDebug() and getDebug() functions. Library Messages will no longer be supported to save on memory.",
                "Added Function Comments to all functions. This will help with the documentation of the library",
                "Adjusted the add funciton to utilize a load factor instead of it waiting to fill to capacity. This will help to ensure the array can be resized.",
                "Added new Sort Algorithm. (Quick Sort) ",
                "Modified the sort function so the user can select between bubble sort and quick sort.",
                "Fixed Library Changelog to reflect current State of Library Changes"
            ]
        }
    ],

    "Notes": "This library is a work in progress. It has been mostly tested and found to be stable. Please use at your own risk. (EXCEPTION: The New functions have not been tested yet)"
}